PreProcessing/Modules/BaseFlowGenerator/DirectFlatPlateModule/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;
                               
vertices
(
(0 0 0)
(150 0 0)
(175 0 0)
(225 0 0)
(250 0 0)
(550 0 0)
(650 0 0)
(0 10 0)
(150 10 0)
(175 10 0)
(225 10 0)
(250 10 0)
(550 10 0)
(650 10 0)
(0 20 0)
(150 20 0)
(175 20 0)
(225 20 0)
(250 20 0)
(550 20 0)
(650 20 0)
(0 0 0.1)
(150 0 0.1)
(175 0 0.1)
(225 0 0.1)
(250 0 0.1)
(550 0 0.1)
(650 0 0.1)
(0 10 0.1)
(150 10 0.1)
(175 10 0.1)
(225 10 0.1)
(250 10 0.1)
(550 10 0.1)
(650 10 0.1)
(0 20 0.1)
(150 20 0.1)
(175 20 0.1)
(225 20 0.1)
(250 20 0.1)
(550 20 0.1)
(650 20 0.1)
);
blocks
(
//Block 1: inlet bottom
hex (0 1 8 7 21 22 29 28) (36 30 2) simpleGrading (1 18 1)
//Block 2: pre-central region bottom
hex (1 2 9 8 22 23 30 29) (6 30 2) simpleGrading (1 18 1)
//Block 3: central region bottom
hex (2 3 10 9 23 24 31 30) (12 30 2) simpleGrading (1 18 1)
//Block 3: post-central region bottom
hex (3 4 11 10 24 25 32 31) (6 30 2) simpleGrading (1 18 1)
//Block 4: main downstream region bottom
hex (4 5 12 11 25 26 33 32) (70 30 2) simpleGrading (1 18 1)
//Block 5: outflow region bottom
hex (5 6 13 12 26 27 34 33) (24 30 2) simpleGrading (1 18 1)

//Block 7: inlet top
hex (7 8 15 14 28 29 36 35) (36 10 2) simpleGrading (1 1 1)
//Block 8: pre-central region top
hex (8 9 16 15 29 30 37 36) (6 10 2) simpleGrading (1 1 1)
//Block 9: central region top
hex (9 10 17 16 30 31 38 37) (12 10 2) simpleGrading (1 1 1)
//Block 10: post-central region top
hex (10 11 18 17 31 32 39 38) (6 10 2) simpleGrading (1 1 1)
//Block 11: main downstream region top
hex (11 12 19 18 32 33 40 39) (70 10 2) simpleGrading (1 1 1)
//Block 12: outflow region top
hex (12 13 20 19 33 34 41 40) (24 10 2) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
    top
    {
        type    patch;
        faces
        (
            (14 15 36 35)
            (15 16 37 36)
            (16 17 38 37)
            (17 18 39 38)
            (18 19 40 39)
            (19 20 41 40)
        );
    }
    inlet
    {
        type    patch;
        faces
        (
            (0 7 28 21)
            (7 14 35 28)
        );
    }
    outlet
    {
        type    patch;
        faces
        (
            (6 27 34 13)
            (13 34 41 20)
        );
    }
    plate
    {
        type    wall;
        faces
        (
            (0 21 22 1)
            (1 22 23 2)
            (2 23 24 3)
            (3 24 25 4)
            (4 25 26 5)
            (5 26 27 6)
        );
    }
    front
    {
        type    cyclic;
        neighbourPatch  back;
        faces
        (
            (0 1 8 7)
            (1 2 9 8)
            (2 3 10 9)
            (3 4 11 10)
            (4 5 12 11)
            (5 6 13 12)
            (7 8 15 14)
            (8 9 16 15)
            (9 10 17 16)
            (10 11 18 17)
            (11 12 19 18)
            (12 13 20 19)
        );
    }
    back
    {
        type    cyclic;
        neighbourPatch  front;
        faces
        (
            (28 29 22 21)
            (29 30 23 22)
            (30 31 24 23)
            (31 32 25 24)
            (32 33 26 25)
            (33 34 27 26)
            (35 36 29 28)
            (36 37 30 29)
            (37 38 31 30)
            (38 39 32 31)
            (39 40 33 32)
            (40 41 34 33)
        );
    }
);
